LiteOS/LiteOS/targets/Standard_LPC824Lite/Src/usart.c
/*----------------------------------------------------------------------------
 * Copyright (c) <2016-2018>, <Huawei Technologies Co., Ltd>
 * All rights reserved.
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 1. Redistributions of source code must retain the above copyright notice, this list of
 * conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice, this list
 * of conditions and the following disclaimer in the documentation and/or other materials
 * provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its contributors may be used
 * to endorse or promote products derived from this software without specific prior written
 * permission.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *---------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------
 * Notice of Export Control Law
 * ===============================================
 * Huawei LiteOS may be subject to applicable export control laws and regulations, which might
 * include those applicable to Huawei LiteOS of U.S. and the country in which you are located.
 * Import, export and usage of Huawei LiteOS in any manner by you shall be in compliance with such
 * applicable export control laws and regulations.
 *---------------------------------------------------------------------------*/

/* Includes -----------------------------------------------------------------*/
#include "usart.h"
#include "fsl_swm.h"
/* Defines ------------------------------------------------------------------*/
#define DEBUG_USART         USART1
#define DEMO_USART_CLKSRC   kCLOCK_CoreSysClk
#define DEMO_USART_CLK_FREQ CLOCK_GetFreq(kCLOCK_CoreSysClk)

/* Typedefs -----------------------------------------------------------------*/
/* Macros -------------------------------------------------------------------*/
/* Local variables ----------------------------------------------------------*/
/* Extern variables ---------------------------------------------------------*/
/* Global variables ---------------------------------------------------------*/
/* Private function prototypes ----------------------------------------------*/
static void USART1_Pins_Init(void)
{
    SWM_Type* pSwm = SWM0;
    
    CLOCK_EnableClock(kCLOCK_Swm);
    CLOCK_EnableClock(kCLOCK_Uart1);

    CLOCK_SetClkDivider(kCLOCK_DivUsartClk, 1);
    
	/* Connect the TXD_O and RXD_I signals to port pins(P0.4, P0.0) */
    SWM_SetFixedPinSelect(pSwm, kSWM_ACMP_INPUT1, false);
    SWM_SetFixedPinSelect(pSwm, kSWM_ADC_CHN11, false);

    SWM_SetMovablePinSelect(pSwm, kSWM_USART1_TXD, kSWM_PortPin_P0_4);
    SWM_SetMovablePinSelect(pSwm, kSWM_USART1_RXD, kSWM_PortPin_P0_0);

    CLOCK_DisableClock(kCLOCK_Swm);
}
/* Public functions ---------------------------------------------------------*/
void Debug_USART1_Init(void)
{
    usart_config_t usartConfig;

    USART1_Pins_Init();

    USART_GetDefaultConfig(&usartConfig);
    
    usartConfig.baudRate_Bps = 115200U;
    usartConfig.enableTx = true;
    usartConfig.enableRx = true;
    USART_Init(DEBUG_USART, &usartConfig, DEMO_USART_CLK_FREQ);
}
/* Private functions --------------------------------------------------------*/
/* define fputc */
#if defined ( __CC_ARM ) || defined ( __ICCARM__ )  /* KEIL and IAR: printf will call fputc to print */
int fputc(int ch, FILE *f)
{
    USART_WriteBlocking(DEBUG_USART, (uint8_t *)&ch, 1);
    return ch;
}
#elif defined ( __GNUC__ )  /* GCC: printf will call _write to print */
__attribute__((used)) int _write(int fd, char *ptr, int len)
{
    USART_WriteBlocking(DEBUG_USART, (uint8_t *)ptr, len);
    return len;
}
#endif

